Revit 2026 API

# MultiReferenceAnnotationTypeIsAllowedTagCategory Method

---

Returns true if tag types belonging to this category can be used with multi-reference annotation types.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsAllowedTagCategory(
	ElementId tagCategoryId
)
```
```vb
Public Shared Function IsAllowedTagCategory (
	tagCategoryId As ElementId
) As Boolean
```
```cpp
public:
static bool IsAllowedTagCategory(
	ElementId^ tagCategoryId
)
```
```fsharp
static member IsAllowedTagCategory :
        tagCategoryId : ElementId -> bool
```

#### Parameters

tagCategoryId ElementId
     The tag category to test.

#### Return Value

Boolean

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only Structural Rebar Tags are allowed.

#### Reference

MultiReferenceAnnotationType Class

Autodesk.Revit.DB Namespace